cawndog/Aquarium-Controller/AquariumControllerESPIDF/AquariumController/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF)  Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOOTLOADER_LOG_LEVEL_ERROR=y
CONFIG_ESPTOOLPY_OCT_FLASH=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_EXAMPLE_CONNECT_WIFI=n
CONFIG_ASYNC_TCP_RUN_NO_AFFINITY=y
CONFIG_ARDUINO_SERIAL_EVENT_RUN_CORE1=y
CONFIG_ARDUINO_SERIAL_EVENT_TASK_STACK_SIZE=8000
CONFIG_ARDUINO_UDP_RUN_CORE1=y
CONFIG_ARDUHAL_LOG_DEFAULT_LEVEL_DEBUG=y
CONFIG_COMPILER_OPTIMIZATION_NONE=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=2000
CONFIG_APPTRACE_DEST_JTAG=y
CONFIG_APPTRACE_SV_ENABLE=y
CONFIG_SPI_SLAVE_ISR_IN_IRAM=n
CONFIG_GPTIMER_ISR_HANDLER_IN_IRAM=n
CONFIG_ESP_EVENT_LOOP_PROFILING=y
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ECC_ENABLE=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8000
CONFIG_ESP_MINIMAL_SHARED_STACK_SIZE=10000
CONFIG_ESP_INT_WDT_TIMEOUT_MS=4000
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_IPC_TASK_STACK_SIZE=10000
CONFIG_ESP_TIMER_TASK_STACK_SIZE=7000
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_COREDUMP_ENABLE_TO_UART=y
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=4000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_ISR_STACKSIZE=8000
CONFIG_HEAP_POISONING_COMPREHENSIVE=y
CONFIG_HEAP_TRACING_TOHOST=y
CONFIG_HEAP_TASK_TRACKING=y
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=4
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=10000
CONFIG_MBEDTLS_PSK_MODES=y
